backend/app/services/orders/checkout_service.rb

    def call
      ActiveRecord::Base.transaction do
        # Find or Create User entity based on name/email
        # Update card number in separated so if the user uses a different card, we dont create another User record in the DB
        @user = User.first_or_create!(user_params)
        @user.update!(card_number: @params["card_number"])
        @user.save!

        # Update Order parameters and state to submitted
        @order = Order.create(order_params)

        # Validate card number
        @order.update!(state: is_card_number_valid)
---
SELECT "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT $1  [["LIMIT", 1]]
UPDATE "users" SET "card_number" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["card_number", "4242 4242 4213 2142"], ["updated_at", "2023-11-22 17:53:14.368608"], ["id", 2]]
INSERT INTO "users" ("name", "email", "card_number", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "miguel"], ["email", "miguel@email.com"], ["card_number", nil], ["created_at", "2023-11-22 00:28:05.809575"], ["updated_at", "2023-11-22 00:28:05.809575"]]
UPDATE "users" SET "card_number" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["card_number", "4242 4242 4242 4242"], ["updated_at", "2023-11-22 00:28:05.813787"], ["id", 1]]
INSERT INTO "orders" ("location", "quantity", "price", "state", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["location", nil], ["quantity", 6], ["price", 35.400000000000006], ["state", 1], ["user_id", 2], ["created_at", "2023-11-22 01:05:35.937601"], ["updated_at", "2023-11-22 01:05:35.937601"]]
UPDATE "orders" SET "state" = $1, "updated_at" = $2 WHERE "orders"."id" = $3  [["state", 3], ["updated_at", "2023-11-22 01:05:35.938953"], ["id", 20]]