backend/app/controllers/api/v1/orders_controller.rb

  def checkout
    service = Orders::CheckoutService.new(checkout_params)
    service.call

    if service.order.success?
---
SELECT "orders".* FROM "orders" WHERE "orders"."id" = $1 LIMIT $2  [["id", 59], ["LIMIT", 1]]